public class 电费计算 {
    double 总用电量;
    double 楼上用电量;
    double 楼下用电量;
    double 楼上所用电量占比为;
    double 楼下所用电量占比为;

    private void 计算电量(int 楼上这月总电, int 楼上上月总电, int 上月总电, int 这月总电) {
        this.总用电量 = 这月总电 - 上月总电;
        this.楼上用电量 = 楼上这月总电 - 楼上上月总电;
        this.楼下用电量 = 总用电量 - 楼上用电量;
        this.楼上所用电量占比为 = Math.round((楼上用电量 / 总用电量) * 100) / 100D;
        this.楼下所用电量占比为 = Math.round((楼下用电量 / 总用电量) * 100) / 100D;
        System.out.println("总用电量:" + 总用电量 + "度" + "= " + 这月总电 + "-" + 上月总电);
        System.out.println("楼上用电量:" + 楼上用电量 + "度" + "= " + 楼上这月总电 + "-" + 楼上上月总电);
        System.out.println("楼下用电量:" + 楼下用电量 + "度" + "= " + 总用电量 + "-" + 楼上用电量);
        System.out.println("楼上所用电量占比为：" + 楼上所用电量占比为 + " =" + 楼上用电量 + " 除以 " + 总用电量);
        System.out.println("楼下所用电量占比为：" + 楼下所用电量占比为 + " =" + 楼下用电量 + " 除以 " + 总用电量);
    }

    private void 计算电费(int 楼下所交电费,int 楼上所交电费){
        int 总金额 =楼下所交电费+楼上所交电费;
        double 楼下应交电费 = 总金额*楼下所用电量占比为;
        double 楼上应交电费 = 总金额*楼上所用电量占比为;
        System.out.println("楼上应交电费:"+楼上应交电费+"元="+总金额+"*"+楼上所用电量占比为);
        System.out.println("楼下应交电费:"+楼下应交电费+"元="+总金额+"*"+楼下所用电量占比为);

        System.out.println("楼下实交电费:"+楼下所交电费+"元.减去应交电费差值为："+(楼下所交电费-楼下应交电费)+"元");
        System.out.println("楼上实交电费:"+楼上所交电费+"元.减去应交电费差值为："+(楼上所交电费-楼上应交电费)+"元");
    }
    public static void main(String[] args) {
        电费计算 电费计算对象 = new 电费计算();
        电费计算对象.计算电量(8143, 7980, 20105, 20330);
        电费计算对象.计算电费(88,57);
    }
}
